// Напишите программу, которая на вход принимает число и 
//выдает его квадрат (число умноженное на само себя).

Console.WriteLine("Write a number:");

int num = int.Parse(Console.ReadLine());
Console.WriteLine(num*num);

